package data

// 数据日志
//
// 插入数据日志的结构如下：
// +----------------+----------------+----------------+----------------+----------------+
// |     type       |      tid       |     page_no    |     offset     |      data      |
// +----------------+----------------+----------------+----------------+----------------+
// |    1 byte      |     8 byte     |     4 byte     |     4 byte     |     * byte     |
// +----------------+----------------+----------------+----------------+----------------+
//
// 更新数据日志的结构如下：
// type tid dataItemId oldData newData
// +----------------+----------------+----------------+----------------+----------------+
// |    type        |      tid       |    item_id     |     old_data   |     new_data   |
// +----------------+----------------+----------------+----------------+----------------+
// |    1 byte      |     8 byte     |     8 byte     |     * byte     |     * byte     |
// +----------------+----------------+----------------+----------------+----------------+

const (
	redoLog = 1
	undoLog = 2

	InsertLog = 1
	UpdateLog = 2
)

func WrapInsertLog() {

}

func ParseInsertLog() {

}

func WrapUpdateLog() {

}

func ParseUpdateLog() {

}
